roam/on_ai_education.org
:PROPERTIES:
:ID:       e0744ef5-4e1c-4a19-992d-c3277bcecc9f
:END:
#+title: On AI Education
#+date: [2022-12-02 Fri 18:45]
#+filetags: video
- Source: https://www.youtube.com/watch?v=bzaMyYqJ030&t=476s
- Channel: [[id:519eebec-b472-4af7-ad29-926e5414e8c4][Adnan Darwiche]]
- Related: [[id:b3a0aa55-d105-4e8f-8497-4421b31739eb][AI]], [[id:cc205a71-5d72-48ac-b6ef-0703963c5bb1][Human-Level Intelligence or Animal-Like Abilities?]]
* Notes
#+begin_quote
What just happened in AI and how it is being misunderstood
#+end_quote
- two main ways to tackle a problem
  - *model-based*
    - represent and reason
    - using logic and probability
  - *function-based*
    - /fit function to data/
      - just give me data, make a *blackbox*
      - no need to understand exactly what's going on under the hood
    - using [[id:578df2f4-8fcb-4c18-90c2-e902f6b6eb16][Neural Network]]
    - taught in the classrooms
    - good for tasks usually associated with perception or cognition
- eras of AI
  - knowldge representation and reasoning
    - very =CS= based
  - machine learning
    - very Statistics and Optimization based
  - neural networks
    - mostly Engineering based
- as we are moving forward the background of researchers are being diluted
- now the tech is being deployed and it's hitting walls
  - there is need of logic skills in the next generation of AI research
  - *solid computer science education is needed*
