content/posts/on_ai_education.md
+++
title = "On AI Education"
date = 2022-12-02T18:45:00+01:00
tags = ["video"]
draft = false
+++

-   Source: <https://www.youtube.com/watch?v=bzaMyYqJ030&t=476s>
-   Channel: [Adnan Darwiche]({{< relref "adnan_darwiche.md" >}})
-   Related: [AI]({{< relref "20210606005210-artificial_intelligence.md" >}}), [Human-Level Intelligence or Animal-Like Abilities?]({{< relref "human_level_intelligence_or_animal_like_abilities.md" >}})


## Notes {#notes}

> What just happened in AI and how it is being misunderstood

-   two main ways to tackle a problem
    -   **model-based**
        -   represent and reason
        -   using logic and probability
    -   **function-based**
        -   _fit function to data_
            -   just give me data, make a **blackbox**
            -   no need to understand exactly what's going on under the hood
        -   using [Neural Network]({{< relref "20210606215832-neural_network.md" >}})
        -   taught in the classrooms
        -   good for tasks usually associated with perception or cognition
-   eras of AI
    -   knowldge representation and reasoning
        -   very `CS` based
    -   machine learning
        -   very Statistics and Optimization based
    -   neural networks
        -   mostly Engineering based
-   as we are moving forward the background of researchers are being diluted
-   now the tech is being deployed and it's hitting walls
    -   there is need of logic skills in the next generation of AI research
    -   **solid computer science education is needed**
